var csv = require('csv');
var fs = require('fs');

var data = [
		{
			"title":"八十步海寓",
			"addressFull":"大梅沙与内环路交界处（东部华侨城大峡谷入口处）",
			"total":"544户",
			"city":"深圳",
			"completion":"2011-11",
			"propertyType":"普通住宅",
			"propertyCompany":"深圳市鼎太物业管理有限公司",
			"price":"24131元\/平米",
			"volumeRate":"1.53",
			"propertyCosts":"3.5元\/平方米·月",
			"parking":"511",
			"greeningRate":"10%",
			"gfa":"55000平方米",
			"metro":"",
			"bus":"",
			"lat":"22.604301",
			"lng":"114.316551",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/b58ae3443a4e012f9e86c266855fc300\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/0cb0677b156c891c96f92ef0a42b6163\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/1647b2fe97f47e4db3cf2f986399214c\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/675534e1d57f2c34fc6d0203590ef219\/200x200.jpg"
			],
			"overview":"八十步海寓位于深圳风景区大梅沙海滨，占地面积为36062平方米，地上分三个低层住宅区构成的高档商住区，总建筑面积80982平方米，其中包括商务公寓建筑面积38056平方米，商业建筑面积16271平方米，地下室车库面积22298平方米。共有8座4-6层高的多层建筑，米墙红瓦，西班牙风情的建筑风格。。八十步海寓商住一体，投资价值大；紧邻万科中心及东部华侨城，距离大梅沙海滨步行不到5分钟；社区临湖而建，景观好，周边配套较为完善。可共享隔湖湖心岛上奥特莱斯购物村资源等。。八十步海寓商务公寓户型大小：45-216㎡。 标准户型推荐为55㎡公寓，该户型科学优雅，客厅、餐厅自然融合，悠悠湖景中体味待客之雅；开放式厨房，举办PARTY很适宜；大露台设计把居住变成风景。处于度假设计，项目所有户型均未分割，仅设计为一室一厅一厨一卫，入居家或投资出租，需自行分隔，会显不便。部分户型多露台设计，可尽享山景、海景、湖景，低层设计，养老、度假极佳。。八十步海寓位于盐田区大梅沙与内环路交界处（东部华侨城大侠谷入口处），公交(大梅沙站)有103、J1可到，搭乘J1从联合广场至大梅沙大约1个小时左右；另外片区周边还有2个直升机停机坪：华侨城直升机停机坪、天琴湾直升机停机坪，可供私人飞机降停；自驾方面，在项目北侧有盐坝高速入口，驾车2分钟左右即可入高速，前往全市，至罗湖地王中心大约半个小时；公共交通工具：另外项目楼下有华侨城车站，多路公车通达；南向行5分钟左右，有梅沙街道办车站。。八十步海寓位于深圳风景区大梅沙海滨，占地面积为36062平方米，地上分三个低层住宅区构成的高档商住区，总建筑面积80982平方米，地上4-6层，其中包括商务公寓建筑面积38056平方米，商业建筑面积16271平方米，地下室车库面积22298平方米。,八十步海寓为滨海住宅，大部分单位可见山景、湖景、海景,八十步海寓是一个具有西班牙风情的建筑群落。。八十步海寓项目位于盐田区大梅沙与内环路交界处（东部华侨城大侠谷入口处），深圳风景区大梅沙海滨区，周边有6个高级大梅沙酒店(2个五星级酒店)：大梅沙京基喜来登、华侨城茵特拉根；2个游艇会：浪骑游艇会、大梅沙游艇会；2个高尔夫球场：东部华侨城高尔夫球场、世纪海景高尔夫球场；片区主要为旅游用地、旅游基地服务设施和海滨度假区。。"
		},
		{
			"title":"红树西岸",
			"addressFull":"滨海大道与沙河东路交汇处",
			"total":"1301户",
			"city":"深圳",
			"completion":"2004-12",
			"propertyType":"普通住宅",
			"propertyCompany":"深圳市百仕达物业管理有限公司",
			"price":"57770元\/平米",
			"volumeRate":"3.39",
			"propertyCosts":"7.5元\/月*平方米",
			"parking":"1900",
			"greeningRate":"77%",
			"gfa":"255300平方米",
			"metro":"地铁二号线红树湾站",
			"bus":"72 231 305 322 337 382 b610",
			"lat":"22.528808496287",
			"lng":"113.97130784882",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/bb6f97d01df28a650926e7d8404da5cd\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/b301e28965e5fde907178ff3c58f6a0c\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/aaf73e0716c7d5b3127e97a813e672a2\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/dd64f4877470fa87e93adaf9547c0af2\/200x200.jpg"
			],
			"overview":"项目位于深圳市南山填海区西南，南面可推窗见海，红树林湿地和香港天水围尽收眼底，北临“世界之窗”、“中华民俗村”，西面紧靠沙河高尔夫球场，东面是红树湾规划中的大型中央主题公园，户户见海，独瞰绝佳自然海景景观。交通位置卓越，距离马上运行的西部通道3分钟车程、皇岗口岸8分钟车程、步行即达深圳地铁2号线出口；诞自世界建筑设计大师手笔，碧水蓝天融于红树湾绿色生态区，大视野、全景观，坐拥现代商务智能空中豪宅气度； 送豪华精装修、观景阳台，投入巨资与世界著名企业LG、霍尼韦尔（Honeywell）及日讯合力打造中国第一智能家居社区，运用多项全国首创高科技智能系统及材料，开创现代住宅居家理念； 户型面积120-520平方米，主力户型150-260平方米，2梯2户，拥有三大主题会所（休闲会所、运动会所、商务会所），私家幼儿园、超市、地下景观车库等配套设施，彰显南中国最具滨海特色的豪宅上善生活品位。"
		},
		{
			"title":"龙光城",
			"addressFull":"西区西南大道（深惠经济合作区）",
			"total":"28000户",
			"city":"深圳",
			"completion":"2020-01",
			"propertyType":"普通住宅",
			"propertyCompany":"龙光物业管理公司",
			"price":"7499元\/平米",
			"volumeRate":"1.10",
			"propertyCosts":"3.00元\/平方米·月",
			"parking":"1567个",
			"greeningRate":"37.20%",
			"gfa":"5000000平方米",
			"metro":"",
			"bus":"",
			"lat":"22.721095",
			"lng":"114.41498",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/41bba15f019afcb0d5e966a3d698b24a\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/c4204b476f8ce7e5fb1fae1808e529aa\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/6f287f4dc443f5f1fe5a70400e7a6bb3\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/daaba6e13c7a83d4d8e1817d9fde5056\/200x200.jpg"
			],
			"overview":"龙光城总占地面积约185万平米，超大规模、内部资源型楼盘。主要由联排水景别墅、湖景别墅、园林景观洋房、欧式高层小高层商住楼、公寓、集中商业风情街、综合写字楼、酒店、会所、市政公交、消防站、西区一中及相应配套公共设施等组成，其中住宅户数可达2万多户。本项目以唯我独尊、雄居惠深市场之翘首的大气，以及海纳百川、汇聚英豪之博大胸怀，将建成精致生态湖景园林社区，必将成为深圳东部大亚湾畔的一颗耀眼明珠，成为新兴财富精英家族首选之城。 龙光城项目位置：大亚湾经济开发区西南片区惠深合作示范区内，毗邻深圳，与龙岗区接壤。 龙光城建筑面积：约500万平米。 龙光城项目特色：采用欧式建筑风格，并结合现代建筑的特点进行提炼、转化、修饰等多种再创意的手法，力求营造出温馨宜人的居住特色。"
		},
		{
			"title":"百仕达花园三期",
			"addressFull":"布心路太白路之间",
			"total":"1288户",
			"city":"深圳",
			"completion":"2003-04",
			"propertyType":"普通住宅",
			"propertyCompany":"深圳百仕达物业管理有限公司",
			"price":"21525元\/平米",
			"volumeRate":"3.39",
			"propertyCosts":"3.50元\/平方米*月",
			"parking":"300",
			"greeningRate":"50.00%",
			"gfa":"1288338平方尺...",
			"metro":"况：地铁三号线好又多距本小区500米左右，地铁五号线深圳市妇幼保健远旁",
			"bus":"2、23、24、208路 203、212、59、379、83、62、107、40",
			"lat":"22.582346454292",
			"lng":"114.14081019371",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/b77a2ea6850167dbafb60ea99099c5fe\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/7047bfa22e1b8e58092e85b84bbedc17\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/73af8484212f4a672b75dfb000282120\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/c8bdc7895a5e08cac262604d8383d8de\/200x200.jpg"
			],
			"overview":"\"项目介绍： 　　发展商：深圳百仕达实业有限公司 香港上市公司百仕达控股（1168）附属机构 　　承建商： 江苏一建 　　总建筑面积：1288338平方尺? 　　层数：32层 栋数：7栋三梯六户 　　住宅单位数目： 1288户 a、地块编号： H312-50 　　占地面积：4978.32平米 总建筑面积：41927.07平米 (其中住宅面积　32407.76平米,商业面积：2476.18平米, 地下室面积：7043.13平米) 　　付款方式：一次性付款和银行按揭；工行、中行提供8成30年按揭 　　代理商：置业国际（中国）有限公司 大学:深圳大学中学:东昌小学，距本小区500米左右，百仕达小学，距本小区300米左右，翠园中学初中部，距本小区600米左右，东湖中学，距本小区300米左右小学:丛飞幼儿园，距本小区300米，新港鸿国际幼儿园，距本小区300米，百仕达幼儿园，距本小区300米市场:吉之岛超市，喜荟城购物广场 邮局:松泉山庄邮电所、布心邮局银行:建设银行小区正门右转500米，农业银行小区正门左转600米、中国"
		},
		{
			"title":"花样年江山",
			"addressFull":"黄江北部旧城区和新城中心区域的交汇处",
			"total":"272户",
			"city":"深圳",
			"completion":"2011-07",
			"propertyType":"别墅",
			"propertyCompany":"花样年华物业公司",
			"price":"6539元\/平米",
			"volumeRate":"2.00",
			"propertyCosts":"1.5元\/平米·月",
			"parking":"293",
			"greeningRate":"35%",
			"gfa":"96863平方米",
			"metro":"",
			"bus":"",
			"lat":"22.863714",
			"lng":"113.986978",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/3c29d67d6bf66e9aba4b0e0eda1ffe5d\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/8fcedffc6e8300ae6bc831e97882e248\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/dea270bc6030a3332d9a41ed4645c99e\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/17419b30f9fcad82bb4065a6f04cd0c3\/200x200.jpg"
			],
			"overview":"开盘时间 2011-07-02 预售许可证 11东莞商房预证字第00130号 花样年江山是继花样年君山成功开发之后东莞公司的又一力作，本项目的开发建设是作为花样年战略布局东莞的第二个项目，是花样年为莞深两地客户量身定做的高档宜居楼盘，其成功开发必将引领黄江房地产市场新的飞跃。 花样年江山位于黄江北部旧城区和南部新城中心区域的交汇处，西侧紧临黄江河及延绵不断的原生山林景观，足不出户享受城市绿肺。 花样年江山占地96863平米，容积率2.5，建筑面积322551.67平米，产品由11-33层的高层和小高层以及具有项目代表性的欧式独立别墅组成，其中洋房产品户型设计实用方正，别墅产品主要沿亲水园林景观布置，尽可能利用最好的自然景观资源，营造出一幅宁静、舒适、恬淡、幽雅、柔美的高档欧式楼盘。该项目将是黄江未来新城中心区域具有代表性的高档住宅小区。 花样年江山分两期开发，一期为多层及小高层，二期高层洋房；交通便利位于莞深高速收费站不远处，黄江主干道公常路旁，总占地9.6万平米，建筑面积32.2万平米，容积率2.5。"
		},
		{
			"title":"星河丹堤",
			"addressFull":"彩田路北银湖西(梅林关口内)",
			"total":"1728户",
			"city":"深圳",
			"completion":"2008-01",
			"propertyType":"别墅",
			"propertyCompany":"星河物业管理公司",
			"price":"44422元\/平米",
			"volumeRate":"1.8",
			"propertyCosts":"4.5元\/平方米·月",
			"parking":"2736个",
			"greeningRate":"38.00%",
			"gfa":"200322.18平方米",
			"metro":"轨道交通4号线",
			"bus":"7 34 234 324 324 350 370 303 329 334 335 415 431 7 812 333 336 339 352 788 542",
			"lat":"22.598603335694",
			"lng":"114.0624384645",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/6f976bf5e1b23bce13c78c817b992027\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/ee09492e7e81ba9bc49bfc913cc4ee28\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/2f06bcb5d71c5c946576ba771ffcf0e9\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/aa984fd863b81ab029b3f53627fede13\/200x200.jpg"
			],
			"overview":"该项目位于彩田路北，临近南坪快速、梅观高速。项目的南、北、东三面为13.47万平方米的银湖山郊野公园，西面为9.1万平方米的原生活水湖。在地段和资源的基础上，星河方面一直将星河丹堤定位于“深圳顶级别墅”。和传统的TOWNHOUSE相比，星河丹堤在强调私密性的前提下，很注意空间的营造。项目的前后庭院、跃式客厅、两层架空地下室等设计，就为业主提供了高附加值的第一生活居所。此外，这一项目的合府、阔庭、厢庭、跃庭等设计，还是国家专利产品。据了解，项目紧邻的银湖山郊野公园，目前已由深圳市**、市**批准立项，星河地产更是捐资600万投入银湖山郊野公园建设中，预计这一公园将在3―5年内完成建设。星河丹堤2期160套叠层TOWNHOUSE，预计将在今年10月发售. 　　　"
		},
		{
			"title":"中旅国际公馆",
			"addressFull":"润田路28号",
			"total":"1541户",
			"city":"深圳",
			"completion":"2003-12",
			"propertyType":"普通住宅",
			"propertyCompany":"中旅集团",
			"price":"51473元\/平米",
			"volumeRate":"2.14",
			"propertyCosts":"3.60元\/平方米・月",
			"parking":"1728",
			"greeningRate":"45%",
			"gfa":"316869.4平方米（包括地下室等）。 其中二期总占地5353",
			"metro":"目前在建地铁侨香站。",
			"bus":"104.73.325.328.323.237.38.25等",
			"lat":"22.554721",
			"lng":"114.021678",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/873975c5bd56e9eab091871096e55154\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/4be78ffe411e0eb512ce50ec75bcbcc1\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/f351ea3a952c67db1166f012c30c29df\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/e8485a11033b4eb4b7e9ae63140e9953\/200x200.jpg"
			],
			"overview":"中旅国际公馆位于深圳市农科中心，一期、二期总占地109361平方米，总建筑面积：316869.4平方米（包括地下室等）。 其中二期总占地53530平方米，总建筑面积193483平方米。其中住宅建筑面积133793平方米，商业建筑面积889平方米，会所1850平方米。幼儿园3000平方米。总共包括4栋11层的小高层，7栋32层的高层。 项目名称：港中旅花园(二期) 宗地号：B302-0047 宗地位置：农科片区 受让日期：1998-5-1 所在区域：福田 权属来源：协议 批准机关：福田分局 合同文号：深地合字（1997）52号 房产证编号：3000166836 使用年限：70年 补充协议：第一 土地用途：住宅 宗地面积：109361.50 价款监管机构：招商银行福中支行 账户名称：港中旅置业(深圳)有限公司 账号：2980068410001 工程监管机构：北京万宇工程监理事务所深圳分所 物业管理公司：港中旅物业管理(深圳)有限公司 管理费：3.60元\/平方"
		},
		{
			"title":"公园大地",
			"addressFull":"龙岗中心城龙翔大道与吉祥中路交汇处（麦当劳岁宝餐厅旁）",
			"total":"3776户",
			"city":"深圳",
			"completion":"2011-06",
			"propertyType":"别墅",
			"propertyCompany":"深圳市鸿荣源物业管理有限公司",
			"price":"20723元\/平米",
			"volumeRate":"1.66",
			"propertyCosts":"2.8元\/月\/平方米",
			"parking":"4682",
			"greeningRate":"33.49%",
			"gfa":"826600平方米",
			"metro":"地铁3号线（09年开通）",
			"bus":"351、353、329、993、923、985等线路都经过",
			"lat":"22.717891",
			"lng":"114.242522",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/fb6476076efed33ec1c33b6d1829e653\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/70b3e0e418af4c9245f79a94279a4b32\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/7bf6bdace557a695bd70b7a6ec78d3af\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/12dc281694206295c0572fd3dd2e7371\/200x200.jpg"
			],
			"overview":"公园大地，位于龙岗区中心城龙翔大道北侧，出机荷高速、水官高速和深惠公路到本地块约7至10分钟，龙城主要干道龙翔大道由东南贯穿到西北，东临吉祥路，北达清林中路，距离海关大厦不到一分钟车程。项目北靠余石岭公园，余石岭公园是深圳市重点景观建设项目，此公园成为本地块天然的后花园，景观资源非常丰富。 　　项目用地面积36万平方米，总建筑面积达77万平方米，产品形态包括Townhouse、小高层和高层。其中Townhouse共计100余套，主力户型为四房及五房，项目配套有园林、幼儿园、会所、游泳池和商业等，其中会所面积约3400平方米、商业（总共约1.4万平方米，其中一期）、幼儿园（三所，大一期两所，其中一所为已建成并投入使用，大二期一所）、泳池（共五个）。鸿荣源凭借多年的开发理念,力将本项目打造成深圳东部第一顶端豪宅。 、 　　公园大地将成为“中央”+“山水”生活的最好写照，作为龙岗中心城首席豪宅，项目园林由著名景观公司香港贝尔高林倾力打造,引入世界著名经典水景园林元素使使园林具有更深厚的文化韵味。 　　整个小区规划布局采用建筑形体高、中、低相结合，并根据地形、地势、组织各功能地块位置，形成丰富的天际线，在小区内部创造最大的中心花园，同时保证高层实现距离的最大化。入口一侧为低建筑物，形成个入口开阔感觉，住宅之间以大的间距为布局特点。"
		},
		{
			"title":"东部华侨城天麓",
			"addressFull":"大梅沙生态旅游区东部华侨城内",
			"total":"182户",
			"city":"深圳",
			"completion":"2008-05",
			"propertyType":"别墅",
			"propertyCompany":"深圳华侨城物业管理有限公司",
			"price":"112151元\/平米",
			"volumeRate":"0.12",
			"propertyCosts":"9.9元\/平方米\/月",
			"parking":"88个 (1：2)",
			"greeningRate":"80%",
			"gfa":"8269.97平方米",
			"metro":"",
			"bus":"",
			"lat":"22.615477729605",
			"lng":"114.3104799739",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/ac2f01a7f978de020800fee014db427f\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/12298f1a8be1cc61c9a249ddf14a51af\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/3f421932fb743609a14ea74c423f81eb\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/ebbaf820e0c55440fdc449bfe1b45564\/200x200.jpg"
			],
			"overview":"由华侨城集团投资35亿元人民币精心打造的东部华侨城，坐落于中国深圳大梅沙，占地近9平方公里，是以“让都市人回归自然”为宗旨、以文化旅游为特色的“国家生态旅游示范区”（国家旅游局、国家环保总局联合颁发）。 东部华侨城在山海间巧妙规划了大侠谷、茶溪谷、云海谷三大主题区域，集生态动感、休闲度假、户外运动等多项文化旅游功能于一体，体现了人与自然的和谐共处。 东部华侨城天麓分七个区域组团开发，总建筑面积15万平方米，一至七区如北门七星般撒落在东部华侨城方圆9平方公里天人合一的诗画仙境中，领衔中国山海低密度住宅。"
		},
		{
			"title":"诺德国际居住区",
			"addressFull":"南山沿湖路与前海路的交汇处西南",
			"total":"2702户",
			"city":"深圳",
			"completion":"2009-03",
			"propertyType":"普通住宅",
			"propertyCompany":"深圳市诺德物业管理有限公司",
			"price":"25574元\/平米",
			"volumeRate":"3.0",
			"propertyCosts":"2.9元\/平方米·月",
			"parking":"1387个",
			"greeningRate":"60%",
			"gfa":"207652平方米",
			"metro":"规划中地铁五号线会在月亮湾鲤鱼门",
			"bus":"42、51 、369、396、350、210、76 ,122,229,81",
			"lat":"22.518657",
			"lng":"113.906327",
			"images":[
				"http:\/\/pic1.ajkimg.com\/display\/bbf7c6719ec40d3e2b9ff502ea2f7d62\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/f22f0ab36d4485b35cf28eb2b8c03f1b\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/a03990bc973c53bd150223250d8a88e3\/200x200.jpg",
				"http:\/\/pic1.ajkimg.com\/display\/e4a22a81b96012484597a9957f71edf2\/200x200.jpg"
			],
			"overview":"继诺德中心之后，诺德系列又一精工品质之作——诺德国际居住区全市热销中。项目地处规划建设中的前海中心区（定位高端服务业总部基地），紧临大南山和青青世界，同时拥有城市稀缺生态山体景观资源及前海湾开阔海景。周边多条城市主干线经过，临近西部通道及规划建设中的地铁1、5号线，可便捷通达深圳各大中心区域及香港。 项目拥有近26万平米的建筑规模，50000平米现代原生态公园式园林，产品定位主要针对都市白领精英阶层，主力户型为78－80㎡二房可变三房及86－89㎡三房可变四房。附送面积比例达15%左右。社区近2000平米的运动会所包括室内恒温泳池（500平米）、羽毛球（2个）、健身房及瑜珈室等时尚高端项目，同时还配套室外泳池（2000平米）、网球场（2个）、篮球场（标准场）、风情商业街及品牌超市等，将倾力打造专属于都市精英生活的现代乌托邦。"
		}
	];

csv.stringify(data, function(err, output){
  //console.log(output);
  fs.appendFileSync('./test.csv', output);
});

csv.stringify(data, function(err, output){
  //console.log(output);
  fs.appendFileSync('./test.csv', output);

  csv.parse(output, function(error, out){
  	error && console.log(error);
  	console.log(out);
  })
});